In [183]:
# train data 파일을 읽어서 데이터 프레임 구성하세요
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [140]:
titanic = pd.read_csv('data-files/a2.titanic-train.csv')

In [141]:
titanic.info() # 데이터 프레임의 구조를 표시

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [142]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [143]:
# 원본 데이터의 복사본을 만들어서 저장하세요
# titanic_copy = titanic

#선생님
# 원본 데이터의 복사본을 만들어서 저장하세요
original_titanic=titanic.copy()

In [144]:
print(titanic_copy)

PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [186]:
# 각 컬럼별로 결측치 데이터와 비율 출력(isnull()함수를 검색해서 사용법 검토하고 사용)하세요
# isnull_titanic=pd.isnull(titanic_copy)

# nan_cnt=titanic_copy.isnull().sum()
# print(nan_cnt)

# ratio_Age=nan_cnt['Age']/len(titanic_copy)
# ratio_Cabin=nan_cnt['Cabin']/len(titanic_copy)

#선생님
#titanic.isnull().sum(axis=0).sort_values(ascending=False)  # true의 개수 #sum(axis=1)이면 열방향
na_data=titanic.isnull() # 
#print(na_data)
(na_data.sum() / na_data.count()).sort_values(ascending=False)

pd.DataFrame({ "cnt" : na_data.sum(), "ratio" : na_data.sum() / na_data.count() })

             cnt     ratio
PassengerId    0  0.000000
Survived       0  0.000000
Pclass         0  0.000000
Name           0  0.000000
Sex            0  0.000000
Age          177  0.198653
SibSp          0  0.000000
Parch          0  0.000000
Ticket         0  0.000000
Fare           0  0.000000
Cabin        687  0.771044
Embarked       2  0.002245

In [146]:
print(ratio_Age,ratio_Cabin)

0.19865319865319866 0.7710437710437711

In [147]:
# # if isnull_titanic == False:
# #     print(0)

# # else:
# #     print(1)
# b=(isnull_titanic)
# titanic_T='True'
# titanic_F='False'
# bool_true=(titanic_T=='True')
# bool_false=(titanic_F=='False')
# #isnull_titanic.sum/len(isnull_titanic)

In [148]:
print(isnull_titanic)

PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0          False     False   False  False  False  False  False  False   False
1          False     False   False  False  False  False  False  False   False
2          False     False   False  False  False  False  False  False   False
3          False     False   False  False  False  False  False  False   False
4          False     False   False  False  False  False  False  False   False
..           ...       ...     ...    ...    ...    ...    ...    ...     ...
886        False     False   False  False  False  False  False  False   False
887        False     False   False  False  False  False  False  False   False
888        False     False   False  False  False   True  False  False   False
889        False     False   False  False  False  False  False  False   False
890        False     False   False  False  False  False  False  False   False

      Fare  Cabin  Embarked
0    False   True     False
1    False  False     False
2    False   True     False
3    False  False     False
4    False   True     False
..     ...    ...       ...
886  False   True     False
887  False  False     False
888  False   True     False
889  False  False     False
890  False   True     False

[891 rows x 12 columns]

In [189]:
# 나이의 평균을 계산하세요
# age = titanic_copy['Age']
# age.sum()/len(age)

#선생님
titanic['Age'].mean()
titanic.mean() # 계산 안되는건 제외한 나머지 컬럼당 평균을 계산한다
titanic.describe() #컬럼별 기초통계량

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [202]:
# SibSp 컬럼과 Parch 컬럼 갑의 합을 사용해서 FamilySize 컬럼을 만드세요
# titanic_copy.head(5)
# a=titanic_copy['SibSp'].sum()
# #print(a)
# b=titanic_copy['Parch'].sum()
# #print(b)
# c=a+b
# #print(c)
# FamilySize= print(a,b)
# print(FamilySize)
# # FamilySize = titanic_copy['SibSp']+ titanic_copy['Parch']
# # print(FamilySize)
# # FamilySize = pd.DataFrame(SibSpcol,Parchcol)

titanic[["SibSp",'Parch']]
titanic['FamilySize']= titanic['SibSp'] + titanic['Parch']
titanic.drop(['SibSp','Parch'], axis=1, inplace=False) #s,p빼기 # 원본 바꾸기
titanic.head()

KeyError: "None of [Index(['SibSp', 'Parch'], dtype='object')] are in the [columns]"

In [201]:
titanic.drop([0,1], axis=0, inplace=False) #s,p빼기 # 원본 바꾸기

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,FamilySize
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q,0
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,E46,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False